#### Using loc  and iloc In Selecting Data

In [ ]:
#I. To select data on a DataFrame, Pandas loc and iloc are the top favorites.
#II.They are fast,quick, easy to read, and sometimes interchangeable.

#### 1.Differences between loc and iloc

In [ ]:
# a.The main difference between loc and iloc is:

# loc is label-based,which means that you have to specify rows and columns,
# based on their row and column labels.

# iloc is integer position-based, 
# so you have to specify rows and columns by their integer position values (0-based integer position).

In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
url = 'https://raw.githubusercontent.com/alanjones2/ajbooks/main/data/londonweather2018.csv'
df = pd.read_csv(url,index_col='Month')

df

       Tmax  Tmin  Rain    Sun
Month
Jan     9.7   3.8  58.0   46.5
Feb     6.7   0.6  29.0   92.0
Mar     9.8   3.0  81.2   70.3
Apr    15.5   7.9  65.2  113.4
May    20.8   9.8  58.4  248.3
Jun    24.2  13.1   0.4  234.5
Jul    28.3  16.4  14.8  272.5
Aug    24.5  14.5  48.2  182.1
Sep    20.9  11.0  29.4  195.0
Oct    16.5   8.5  61.0  137.0
Nov    12.2   5.8  73.8   72.9
Dec    10.7   5.2  60.6   40.3

#### 2. Selecting using a single value

In [3]:
# Example 1:
# To get May's  Minimum temperature(Tmin) :
# Pass label to `loc`
df.loc['May', 'Tmin']

9.8

In [3]:
df.loc['Jul','Tmax']

28.3

In [4]:
df.iloc[6, 0]

28.3

In [5]:
# The equivalent `iloc` statement should take row number 4 and column number 1
df.iloc[4, 1]

9.8

In [5]:
df.loc['Aug','Rain']

48.2

In [6]:
df.iloc[7, 2]

48.2

#### Use : to return all data

In [6]:
# To get all rows:
df.loc[:,'Tmin']

Month
Jan     3.8
Feb     0.6
Mar     3.0
Apr     7.9
May     9.8
Jun    13.1
Jul    16.4
Aug    14.5
Sep    11.0
Oct     8.5
Nov     5.8
Dec     5.2
Name: Tmin, dtype: float64

In [7]:
# The equivalent iloc :
df.iloc[:,1]

Month
Jan     3.8
Feb     0.6
Mar     3.0
Apr     7.9
May     9.8
Jun    13.1
Jul    16.4
Aug    14.5
Sep    11.0
Oct     8.5
Nov     5.8
Dec     5.2
Name: Tmin, dtype: float64

In [7]:
df.loc[:, 'Sun']

Month
Jan     46.5
Feb     92.0
Mar     70.3
Apr    113.4
May    248.3
Jun    234.5
Jul    272.5
Aug    182.1
Sep    195.0
Oct    137.0
Nov     72.9
Dec     40.3
Name: Sun, dtype: float64

In [8]:
df.iloc[:, 3]

Month
Jan     46.5
Feb     92.0
Mar     70.3
Apr    113.4
May    248.3
Jun    234.5
Jul    272.5
Aug    182.1
Sep    195.0
Oct    137.0
Nov     72.9
Dec     40.3
Name: Sun, dtype: float64

In [8]:
# To get all columns :
df.loc['May', :]

Tmax     20.8
Tmin      9.8
Rain     58.4
Sun     248.3
Name: May, dtype: float64

In [9]:
# The equivalent iloc:
df.iloc[4, :]

Tmax     20.8
Tmin      9.8
Rain     58.4
Sun     248.3
Name: May, dtype: float64

In [9]:
df.loc['Sep', :]

Tmax     20.9
Tmin     11.0
Rain     29.4
Sun     195.0
Name: Sep, dtype: float64

In [10]:
df.iloc[8, :]

Tmax     20.9
Tmin     11.0
Rain     29.4
Sun     195.0
Name: Sep, dtype: float64

#### 3. Selecting via a list of values

In [11]:
# Multiple Rows:
df.loc[['Jul','Aug'], 'Sun']

Month
Jul    272.5
Aug    182.1
Name: Sun, dtype: float64

In [14]:
# The equivalent iloc:
df.iloc[[6,7], 3]

Month
Jul    272.5
Aug    182.1
Name: Sun, dtype: float64

In [11]:
df.loc[['May','Jun'],'Rain']

Month
May    58.4
Jun     0.4
Name: Rain, dtype: float64

In [12]:
df.iloc[[4,5],2]

Month
May    58.4
Jun     0.4
Name: Rain, dtype: float64

In [ ]:
# =================================

In [15]:
# Multiple columns:
df.loc['May',['Tmin','Rain']]

Tmin     9.8
Rain    58.4
Name: May, dtype: float64

In [16]:
# The equivalent iloc:
df.iloc[4,[1,2]]

Tmin     9.8
Rain    58.4
Name: May, dtype: float64

In [13]:
df.loc['Dec',['Tmax','Sun']]

Tmax    10.7
Sun     40.3
Name: Dec, dtype: float64

In [14]:
df.iloc[11,[0,3]]

Tmax    10.7
Sun     40.3
Name: Dec, dtype: float64

In [ ]:
# === Multiple rows and columns ==

In [17]:
rows = ['Oct', 'Nov']
cols = ['Tmax','Rain']

df.loc[rows, cols]

       Tmax  Rain
Month
Oct    16.5  61.0
Nov    12.2  73.8

In [18]:
# The equivalent iloc:
rows = [9,10]
cols = [0,2]
df.iloc[rows, cols]

       Tmax  Rain
Month
Oct    16.5  61.0
Nov    12.2  73.8

In [15]:
rows = ['Feb','Mar']
col = ['Tmin','Sun']
df.loc[rows,col]

       Tmin   Sun
Month
Feb     0.6  92.0
Mar     3.0  70.3

In [17]:
rows = [1,2]
col = [1,3]
df.iloc[rows,col]

       Tmin   Sun
Month
Feb     0.6  92.0
Mar     3.0  70.3

In [ ]:
# ==============================

#### 4. Selecting a range of data via slice

In [23]:
# Slicing column labels:
rows = ['Feb', 'Mar']
df.loc[rows, 'Tmax':'Rain']

       Tmax  Tmin  Rain
Month
Feb     6.7   0.6  29.0
Mar     9.8   3.0  81.2

In [25]:
# The equivalent iloc :
df.iloc[[1,2],0:3]

       Tmax  Tmin  Rain
Month
Feb     6.7   0.6  29.0
Mar     9.8   3.0  81.2

In [29]:
# Slicing row labels:
cols = ['Tmin','Rain']
df.loc['Mar':'Jun', cols]

       Tmin  Rain
Month
Mar     3.0  81.2
Apr     7.9  65.2
May     9.8  58.4
Jun    13.1   0.4

In [25]:
# The equivalent iloc:
df.iloc[2:6, 1:3]

       Tmin  Rain
Month
Mar     3.0  81.2
Apr     7.9  65.2
May     9.8  58.4
Jun    13.1   0.4

In [ ]:
# =======================

#### 5. Selecting via conditions

#### 5.1 Conditions:

In [26]:
df

       Tmax  Tmin  Rain    Sun
Month
Jan     9.7   3.8  58.0   46.5
Feb     6.7   0.6  29.0   92.0
Mar     9.8   3.0  81.2   70.3
Apr    15.5   7.9  65.2  113.4
May    20.8   9.8  58.4  248.3
Jun    24.2  13.1   0.4  234.5
Jul    28.3  16.4  14.8  272.5
Aug    24.5  14.5  48.2  182.1
Sep    20.9  11.0  29.4  195.0
Oct    16.5   8.5  61.0  137.0
Nov    12.2   5.8  73.8   72.9
Dec    10.7   5.2  60.6   40.3

In [29]:
# Single condition : Rain greater than 50 -
df.loc[df.Rain > 50]

       Tmax  Tmin  Rain    Sun
Month
Jan     9.7   3.8  58.0   46.5
Mar     9.8   3.0  81.2   70.3
Apr    15.5   7.9  65.2  113.4
May    20.8   9.8  58.4  248.3
Oct    16.5   8.5  61.0  137.0
Nov    12.2   5.8  73.8   72.9
Dec    10.7   5.2  60.6   40.3

In [33]:
# Single condition :equivalent iloc: Rain greater than 50 
df.iloc[list(df.Rain >50)]

       Tmax  Tmin  Rain    Sun
Month
Jan     9.7   3.8  58.0   46.5
Mar     9.8   3.0  81.2   70.3
Apr    15.5   7.9  65.2  113.4
May    20.8   9.8  58.4  248.3
Oct    16.5   8.5  61.0  137.0
Nov    12.2   5.8  73.8   72.9
Dec    10.7   5.2  60.6   40.3

In [30]:
# Multiple conditions : Rain > 50 & Sun >= 200
df.loc[
    (df.Rain > 50) & (df.Sun >= 200)
]

       Tmax  Tmin  Rain    Sun
Month
May    20.8   9.8  58.4  248.3

In [31]:
# Multiple conditions : Rain > 50 & Sun >= 200 ; ( Display only Tmax & Tmin)
df.loc[
    (df.Rain > 50) & (df.Sun >= 200),
    ['Tmax', 'Tmin']
]

       Tmax  Tmin
Month
May    20.8   9.8

In [34]:
# Multiple conditions : Rain > 50 & Sun >= 200
# equivalent iloc:
df.iloc[
       list((df.Rain > 50) & (df.Sun >= 200)),
    :,
]

       Tmax  Tmin  Rain    Sun
Month
May    20.8   9.8  58.4  248.3

In [ ]:
# ======== Class Activity ===========